# 格式化整数和浮点数

# 题目1：格式化整数

n = 1234
print(format(n, '10d')) # 默认左侧补空格
print(format(n,'0>10d'))# 左侧补0 >左侧补
print(format(n,'0<10d'))# 右侧补0 <右侧补

# 题目2：格式化浮点数

x1 = 1234.56789
x2 = 31.1
print(format(x1,'0.2f')) # 保留小数点后两位
print(format(x2,'0.2f')) # 保留小数点后两位,不足补0

# 题目3：描述format函数

# 第二个参数用于设置格式化的规则
print(format(x2,'*>15.4f')) # 右对齐， ********31.1000
print(format(x2,'*<15.4f')) # 左对齐， 31.1000********
print(format(x2,'*^15.4f')) # 中心对齐 ****31.1000****
print(format(123456789,','))# 用千位号分隔 123,456,789
print(format(1234567.8766765456,',.2f')) # 前面用千位号分隔 1，234，567.88

print(format(x1,'e')) # 科学计数法输出；大小写均可 1.234568e+03
print(format(x1,'0.2E')) #1.23E+03
